Repository: ANamelessWolf/NamelessAPI
Catalog: src/Core/Assets/Strings.*.resx
Languages: es

# ERR_CAT_DUPLICATED
source: Duplicate category "{0}", category must be unique.
es: Categoría duplicada "{0}", las categorías deben ser unicas.

# ERR_CAT_NOT_FOUND
source: The category "{0}" does not exists on the configuration file.
es: La categoría "{0}" no existe en el archivo de configuración.

# ERR_COMPARING_ASSEMBLY_VERSION
source: An error was found comparing two assemblies versions, the assemblies must had the same name.
es: Se encontró un error al comparar dos versiones de ensamblados, los ensamblados deben tener el mismo nombre.

# ERR_CREATING_FILE
source: An error was found creating the file "{0}".
es: Se ha encontrado un error al crear el archivo "{0}".

# ERR_DECRYPTING_STR
source: An error was found decrypting the string.
es: Se ha encontrado un error al descifrar la cadena.

# ERR_DIR_MISSING
source: The directory "{0}" does not exists.
es: El directorio "{0}" no existe.

# ERR_DOWNLOADING
source: An error was found adding downloading the file "{0}".
es: Se ha encontrado un error descargando el archivo "{0}".

# ERR_ENCRYPTING_STR
source: An error was found encrypting the string.
es: Se encontró un error al cifrar la cadena.

# ERR_ENCRYPTION_EMPTY_STR
source: An error was found encrypting or decrypting the string, can't use encryption with an empty string.
es: Se encontró un error al cifrar o descifrar la cadena, no se puede usar el cifrado con una cadena vacía.

# ERR_FILE_MISSING
source: The file "{0}" not exists.
es: El archivo "{0}" no existe.

# ERR_INIT_MEDAKA
source: Error initializing the Medaka configuration file.
es: Error al inicializar el archivo de configuración de Medaka.

# ERR_KEY_ALREADY_IN_XML_COLL
source: The XElement can not be added because its key is already part of the XCollection.
es: El elemento XElement no se puede agregar porque su clave ya forma parte de la XCollection.

# ERR_PROPERTY_NOT_FOUND
source: The property "{0}" couldn't be found on the category "{1}".
es: No se pudo encontrar la propiedad "{0}" en la categoría "{1}".

# ERR_PROP_DUPLICATED
source: Duplicate property "{0}", property must be unique.
es: Propiedad duplicada "{0}", las propiedades deben ser unicas.

# ERR_SAVING_FILE
source: An error was found saving the file "{0}".
es: Se ha encontrado un error al guardar el archivo "{0}".

# ERR_SCANNING
source: An error was found scanning the "{0}".
es: Se ha encontrado un error al escanear el "{0}".

# ERR_XML_CHILDREN_INDEX_OUT_OF_BOUNDS
source: An error was found accessing the children by its index. The index "{0}" is out of bounds.
es: Se encontró un error al acceder a los niños por su índice. El índice "{0}" está fuera de límites.

# ERR_XML_DUPLICATED_ATT
source: An error was found adding the attribute "{0}" at node "{0}". Attributes mus be unique.
es: Se ha encontrado un error añadiendo el atributo "{0}" en el nodo "{0}". Los atributos deben ser únicos.

# ERR_XML_EXPORTING
source: An error occurred exporting the xml file.
es: Se produjo un error al exportar el archivo xml.

# ERR_XML_MISSING_ATTRIBUTE
source: The xml does not have the attribute "{0}".
es: El xml no tiene el atributo "{0}".

# ERR_XML_MISSING_NODE
source: The xml does not have the node "{0}".
es: El xml no tiene el nodo "{0}".

# ERR_XML_NODE_NOT_UNIQUE
source: An error was found, xml node names must be unique.
es: Se ha encontrado un error, los nombres de nodo XML deben ser únicos.
